ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Examples/MDR1986VK01/usb_cdc_echo/MDR1986VK01_usb_device.c
/**
  ******************************************************************************
  * @file    MDR1986VK01_usb_device.c
  * @author  Milandr Application Team
  * @version V1.1.0
  * @date    07/04/2022
  * @brief   USB Library device source file.
  ******************************************************************************
  * <br><br>
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2022 Milandr</center></h2>
  */

/* Includes ------------------------------------------------------------------*/
#include "MDR1986VK01_config.h"
#include "MDR1986VK01_usb.h"
#include "MDR1986VK01_usb_handlers.h"
#include <stdio.h>

#define ASSERT_INFO_FILE_ID    FILEID__MDR1986VK01_USB_DEVICE_C

/** @addtogroup __MDR1986VK01_StdPeriph_Driver MDR1986VK01 Standard Peripherial Driver
 * @{
 */

/** @addtogroup USB_DEVICE_AND_CDC USB DEVICE AND CDC
 * @{
 */

/** @defgroup USB_Device_Framework_Private_Types USB Device Framework Private Types
 * @{
 */

/** @} */ /* End of group USB_Device_Framework_Private_Types */

/** @defgroup USB_EndPoint USB EndPoint
 * @{
 */

/** @defgroup USB_EndPoint_Private_Types USB EndPoint Private Types
 * @{
 */

/**
 * @brief EndPoint States
 */

typedef enum
{
    USB_EP_NAK,
    USB_EP_IDLE,
    USB_EP_IN,
    USB_EP_OUT,
    USB_EP_SETUP,
    USB_EP_STALL
}USB_EPState_TypeDef;

/**
 * @brief EndPoint State Machine Context type
 */

typedef struct
{
    USB_EPState_TypeDef EP_State;
    USB_StallType       EP_Halt;
    struct
    {
        struct
        {
            /* IN-OUT transactions buffer */
            uint8_t *pBuffer;
            uint32_t length, offset;
            uint32_t bytesToAck;                                                                               /* number of bytes sent to host in
                                                                                                                  IN transaction but not acknowledged yet */
        }                        IO_Buffer;
        /* SETUP-transaction */
        USB_SetupPacket_TypeDef *pSetupPacket;
    }                    Buffer;
    FlagStatus           EP_WasScdone;
    FlagStatus           EP_WaitOut, EP_WaitSetup;
    USB_EP_IO_Handler    InHandler;
    USB_EP_IO_Handler    OutHandler;
    USB_EP_Setup_Handler SetupHandler;
    USB_EP_Error_Handler ErrorHandler;
}USB_EPContext_TypeDef;

/**
 * @brief DATA bit change control
 */

typedef enum
{
    USB_DATA_BIT_KEEP,
    USB_DATA_BIT_TOGGLE,
    USB_DATA_BIT_DATA1,
}USB_EPData_Bit_TypeDef;

/** @} */ /* End of group USB_EndPoint_Private_Types */

/** @defgroup USB_EndPoint_Private_Values USB EndPoint Private Values
 * @{
 */

/**
 * @brief EndPoint State Machine Context
 */

USB_EPContext_TypeDef USB_EPContext[ Num_USB_EndPoints ];

/** @} */ /* End of group USB_EndPoint_Private_Values */

/** @defgroup USB_EndPoint_Private_Constants USB EndPoint Private Constants
 * @{
 */

/** @} */ /* End of group USB_EndPoint_Private_Constants */

/** @defgroup USB_EndPoint_Private_Macros USB EndPoint Private Macros
 * @{
 */

#define TX_FIFO_FORCE_EMPTY( EndPoint )    USB_SetSEPxTXFDC( EndPoint, 1 )
#define RX_FIFO_FORCE_EMPTY( EndPoint )    USB_SetSEPxRXFC( EndPoint, 1 )
#define EPx_RX_FIFO_DATA( EndPoint )       USB_GetSEPxRXFD( EndPoint )

/** @} */ /* End of group USB_EndPoint_Private_Macros */

/** @defgroup USB_EndPoint_Private_FunctionPrototypes USB EndPoint Private Function Prototypes
 * @{
 */

static void USB_EP_sendInDataPortion( USB_EP_TypeDef EPx, USB_EPData_Bit_TypeDef DataBitChange );
static void USB_EP_SetReady( USB_EP_TypeDef EPx, uint32_t val );

/** @} */ /* End of group USB_EndPoint_Private_FunctionPrototypes */

/** @defgroup USB_EndPoint_Private_Functions USB EndPoint Private Functions
 * @{
 */

/**
 * @brief  Initial EndPoint setup
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 * @param  USB_EP_Ctrl: Value, controlling EPISOEN, EPDATASEQ bits
 *         of corresponding USB_SEPx.CTRL register.
 * @param  onError: User's handler to be called on any error with data transmitting
 *                   via this End Point (may be 0).
 *
 * @retval USB_Result status (USB_SUCCESS or USB_ERROR).
 */

USB_Result USB_EP_Init( USB_EP_TypeDef EPx, USB_EP_Error_Handler onError )
{
    USB_EPContext_TypeDef *ep = USB_EPContext + EPx;

    /* EndPoint context preparation */
    ep->Buffer.IO_Buffer.pBuffer    = 0;
    ep->Buffer.IO_Buffer.length     = 0;
    ep->Buffer.IO_Buffer.bytesToAck = 0;
    ep->Buffer.IO_Buffer.offset     = 0;
    ep->Buffer.pSetupPacket         = 0;
    ep->InHandler                   = 0;
    ep->OutHandler                  = 0;
    ep->SetupHandler                = 0;
    ep->ErrorHandler                = onError;
    ep->EP_Halt                     = USB_STALL_PROTO;
    ep->EP_State                    = USB_EP_NAK;
    ep->EP_WasScdone                = RESET;

    return USB_SUCCESS;
}

/**
 * @brief  Resets the EndPoint to NAK state
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @retval USB_Result.
 */

USB_Result USB_EP_Reset( USB_EP_TypeDef EPx )
{
    USB_EPContext_TypeDef *ep = USB_EPContext + EPx;

    ep->EP_State     = USB_EP_NAK;
    ep->EP_WasScdone = RESET;

//    USB_SetSEPxCTRL(EPx, USB_SEPx_CTRL_EPISOEN_Reset  |                           /* Reset Isohronic */
//                    USB_SEPx_CTRL_EPRDY_NotReady |                           /* Reset READY */
//                        USB_SEPx_CTRL_EPEN_Enable);                              /* Set ENABLE */

    return USB_SUCCESS;
}

/**
 * @brief  Switches the EndPoint to IDLE (wait for transaction) or NAK state
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @retval USB_Result.
 *
 * @note   IDLE state and EPRDY bit are set if OUT/SETUP transaction is expected.
 *         Otherwise, this function switches to NAK state.
 */

USB_Result USB_EP_Idle( USB_EP_TypeDef EPx )
{
    USB_EPContext_TypeDef *ep = USB_EPContext + EPx;
//    uint32_t val = USB_SEPx_CTRL_EPSSTALL_NotReply;                               /* Reset STALL reply */

    if ( ep->EP_WaitOut || ep->EP_WaitSetup )
    {
        ep->EP_State = USB_EP_IDLE;
//        val |= USB_SEPx_CTRL_EPRDY_Ready;                                           /* Set READY */
    }
    else
    {
        ep->EP_State = USB_EP_NAK;
    }
    ep->EP_Halt = USB_STALL_PROTO;

//    USB_EP_SetReady(EPx, val);

    return USB_SUCCESS;
}

/**
 * @brief  Switches the EndPoint to STALL state (protocol stall
 *         or halt) or NAK state, if STALL is prohibited.
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @param  bHalt: Specifies whether the STALL state is a HALT
 *         This parameter can be: USB_STALL_PROTO or USB_STALL_HALT.
 *
 * @retval USB_Result.
 *
 * @note   If protocol stall is ordered, but the EndPoint doesn't accept
 *         SETUP transactions, EndPoint is switched to NAK state.
 */

USB_Result USB_EP_Stall( USB_EP_TypeDef EPx, USB_StallType bHalt )
{
    USB_EPContext_TypeDef *ep  = USB_EPContext + EPx;
    uint32_t               val = 0;

    if ( bHalt == USB_STALL_HALT && EPx == USB_EP0 )
    {
        /* No functional stall for Default Control Pipe */
        return USB_ERROR;
    }

