ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Examples/MDR1986VK01/usb_cdc_echo/MDR1986VK01_usb_device.c
    if ( bHalt == USB_STALL_HALT || ep->EP_WaitSetup )
    {
        ep->EP_Halt  = bHalt;
        ep->EP_State = USB_EP_STALL;
//        val = USB_SEPx_CTRL_EPSSTALL_Reply |                                          /* Set STALL reply */
//            USB_SEPx_CTRL_EPRDY_Ready;                                              /* Set READY */
    }

    USB_EP_SetReady( EPx, val );

    return USB_SUCCESS;
}

/**
 * @brief  Indicates that there is data to be sent to the host by this
 *         EndPoint with one or several IN-transactions.
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @param  Buffer: Pointer to the user's buffer with data to be sent.
 *
 * @param  Length: Length of data.
 *
 * @param  onInDone: User's handler to be called when data transfer is
 *                   successfully complete (may be 0).
 *
 * @retval USB_Result.
 */

USB_Result USB_EP_doDataIn( USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length, USB_EP_IO_Handler onInDone )
{
    USB_EPContext_TypeDef *ep = USB_EPContext + EPx;
    /* Setup IN Data stage starts with DATA1 */
    USB_EPData_Bit_TypeDef StartInStage = ( ep->EP_WaitSetup ? USB_DATA_BIT_DATA1 : USB_DATA_BIT_TOGGLE );

    /* Set EndPoint context */
    ep->Buffer.IO_Buffer.pBuffer    = Buffer;
    ep->Buffer.IO_Buffer.length     = Length;
    ep->Buffer.IO_Buffer.bytesToAck = MAX_PACKET_SIZE;
    ep->Buffer.IO_Buffer.offset     = 0;
    ep->InHandler                   = onInDone;

    if ( EPx == USB_EP0 )
    {
        if ( Length > MAX_PACKET_SIZE )
        {
            ep->EP_State = USB_EP_IN;
            StartInStage = USB_DATA_BIT_KEEP;
        }
        else
        {
            ep->EP_State = USB_EP_IDLE;
            StartInStage = USB_DATA_BIT_TOGGLE;
        }
    }
    else
    {
        ep->EP_State = USB_EP_IN;
        StartInStage = USB_DATA_BIT_KEEP;
    }

    /* Send first data portion */
    USB_EP_sendInDataPortion( EPx, StartInStage );

    return USB_SUCCESS;
}

/**
 * @brief  Indicates that we are willing to receive Length or more bytes of data
 *         from the host to this EndPoint with OUT transaction(s).
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @param  Buffer: Pointer to the user's buffer to place received data to.
 *                 The total buffer size should be equal or greater then
 *                 ((Length / MAX_PACKET_LENGTH) + 1) * MAX_PACKET_LENGTH)
 *
 * @param  Length: The minimal data length to receive before the transfer is
 *                 treated as complete.
 *
 * @param  onOutDone: User's handler to be called after Length or more bytes of
 *                    data is successfully received (may be 0).
 *
 * @retval USB_Result.
 */

USB_Result USB_EP_doDataOut( USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length, USB_EP_IO_Handler onOutDone )
{
    USB_EPContext_TypeDef *ep = USB_EPContext + EPx;

    /* Set EndPoint context */
    ep->Buffer.IO_Buffer.pBuffer    = Buffer;
    ep->Buffer.IO_Buffer.length     = Length;
    ep->Buffer.IO_Buffer.bytesToAck = 0;
    ep->Buffer.IO_Buffer.offset     = 0;
    ep->OutHandler                  = onOutDone;
    ep->EP_WaitOut                  = SET;

    /* Start awaiting for OUT transaction */
    MDR_USB0->CSR0_TXCSR |= ( 1 << 8 );
    USB_EP_Idle( EPx );

    return USB_SUCCESS;
}

/**
 * @brief  Indicates that we are willing to receive (repeatedly) Setup Control
 *         Transactions with this EndPoint.
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @param  USB_SetupPacket: Pointer to the user's buffer to place
 *         received setup packet.
 *
 * @param  onSetupPacket: User's handler to be called when setup packet
 *         is received.
 *
 * @retval USB_Result.
 */

USB_Result USB_EP_setSetupHandler( USB_EP_TypeDef EPx, USB_SetupPacket_TypeDef* USB_SetupPacket,
                                   USB_EP_Setup_Handler onSetupPacket )
{
    USB_EPContext_TypeDef *ep = USB_EPContext + EPx;

    /* Set EndPoint context */
    ep->Buffer.pSetupPacket         = USB_SetupPacket;
    ep->Buffer.IO_Buffer.length     = 0;
    ep->Buffer.IO_Buffer.bytesToAck = 0;
    ep->Buffer.IO_Buffer.offset     = 0;
    ep->SetupHandler                = onSetupPacket;
    ep->EP_WaitSetup                = onSetupPacket ? SET : RESET;

    /* Start awaiting for SETUP transaction */
    USB_EP_Idle( EPx );

    return USB_SUCCESS;
}

/**
 * @brief  EndPoint state machine implementation.
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @param  USB_IT: SLAVE controller interrupt flags (USB_SIS register value).
 *
 * @retval USB_Result.
 *
 * @note   This function should be called at appropriate rate to handle possible
 *         EndPoint events.
 */

USB_Result USB_EP_dispatchEvent( USB_EP_TypeDef EPx, uint32_t USB_IT )
{
    FlagStatus             nextIteration = RESET;
    USB_Result             result        = USB_SUCCESS;
//    uint32_t tmpSTS, tmpTS, tmpCTRL, i;
    uint32_t               count;
    USB_EPContext_TypeDef *ep;

//    tmpSTS = USB_GetSEPxSTS(EPx);
//    tmpTS  = (USB_GetSEPxTS(EPx) & USB_SEPx_TS_SCTTYPE_Msk);
//    tmpCTRL = USB_GetSEPxCTRL(EPx);

    ep = USB_EPContext + EPx;

    /* Remember SCDONE event in the EndPoint context */
//    if (USB_IT & USB_SIS_SCTDONE) // Передача успешно завершена
//    {
//        ep->EP_WasScdone = SET;
//    }

    do
    {
        switch ( ep->EP_State )
        {
        /* USB_EP_NAK */
        case USB_EP_NAK:
        {
            /* Fast return if EndPoint in the NAK state */
            return USB_SUCCESS;
        }

        /* USB_EP_IDLE */
        case USB_EP_IDLE:
        {
//                if (!(tmpCTRL & USB_SEP_CTRL_EPRDY) && ep->EP_WasScdone)
//                {
            /* EPRDY dropped - event for this End Point */
            if ( /*(tmpTS == USB_SEPx_TS_SCTTYPE_Outdata) &&*/ ep->EP_WaitOut )
            {
                /* OUT transaction started: switch into the OUT state and continue processing there */
                ep->EP_State   = USB_EP_OUT;
                ep->EP_WaitOut = RESET;
                nextIteration  = SET;
            }
            else if ( /*(tmpTS == USB_SEPx_TS_SCTTYPE_Setup) &&*/ ep->EP_WaitSetup )
            {
                /* SETUP transaction started: switch into the SETUP state and continue processing there */
                ep->EP_State  = USB_EP_SETUP;
                nextIteration = SET;
            }
            else
            {
                /* Unexpected transaction: switch into STALL/NAK state and return error */
                result = USB_ERROR;
                USB_EP_Stall( EPx, USB_STALL_PROTO );
            }
//                }
            break;
        }

        /* USB_EP_IN */
        case USB_EP_IN:
        {
            /* Analyze event type */
//                if ((!(tmpCTRL & USB_SEP_CTRL_EPRDY)) && ep->EP_WasScdone &&
//                    (tmpTS == USB_SEPx_TS_SCTTYPE_In) && (tmpSTS & USB_SEP_STS_SCACKRXED))
//                {
            /* 1. ACK event */
            ep->Buffer.IO_Buffer.offset += ep->Buffer.IO_Buffer.bytesToAck;
            if ( ep->Buffer.IO_Buffer.offset >= ep->Buffer.IO_Buffer.length )
            {
                /* If offset >= length (transfer is over), indicate it with NAK state
                 * and call handler (if present) */
                ep->EP_State = USB_EP_NAK;
                if ( ep->InHandler != 0 )
                {
                    result = ep->InHandler( EPx, ep->Buffer.IO_Buffer.pBuffer, ep->Buffer.IO_Buffer.length );
                }

