ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Examples/MDR1986VK01/usb_cdc_echo/MDR1986VK01_usb_device.c
                if ( result == USB_SUCCESS )
                {
                    /* If no other transaction is ordered by user or no data stage of SETUP
                     * packet (state isn't changed), go to NAK/IDLE state */
                    if ( ep->EP_State == USB_EP_NAK )
                    {
                        USB_EP_Idle( EPx );
                    }
                }
                else
                {
                    /* If user's handler indicated error, go to STALL/NAK state */
                    USB_EP_Stall( EPx, USB_STALL_PROTO );
                }
            }
            else
            {
                /* If there is any data to send remaining, send next portion */
                USB_EP_sendInDataPortion( EPx, USB_DATA_BIT_TOGGLE );
//                        USB_SendData( EPx, Buffer, Length );
            }
//                }
//                else if (tmpSTS & (USB_SEP_STS_SCRXOF
//                                   | USB_SEP_STS_SCCRCERR
//                                       | USB_SEP_STS_SCBSERR
//                                           | USB_SEP_STS_SCRXTO))
//                {
//                    /* 2. Error events - call error handler (if present). Switch temporarily to NAK
//                    * to check if user orders another transaction */
//                    ep->EP_State = USB_EP_NAK;
//                    if (ep->ErrorHandler != 0)
//                    {
//                        result = ep->ErrorHandler(EPx, tmpSTS, tmpTS, tmpCTRL);
//                    }
//                    if (result == USB_SUCCESS)
//                    {
//                        if (ep->EP_State == USB_EP_NAK)
//                        {
//                            /* If there is no user's handler or USB_SUCCESS returned and no other transaction
//                            * is started, retry with current data portion */
//                            ep->EP_State = USB_EP_IN;
//                            USB_EP_sendInDataPortion(EPx, USB_DATA_BIT_KEEP);
//                        }
//                    }
//                    else
//                    {
//                        /* If user's handler indicated error, go to STALL/NAK state */
//                        USB_EP_Stall(EPx, USB_STALL_PROTO);
//                    }
//                }
            break;
        }

        /* USB_EP_OUT */
        case USB_EP_OUT:
        {
            /* Check for event */
//                if (!(tmpCTRL & USB_SEP_CTRL_EPRDY) && ep->EP_WasScdone)
//                {
            nextIteration = RESET;

            /* Read data packet */
            count = USB_GetRxCnt( EPx );
//                    for (i = 0; i < count; i++)
//                    {
//                        ep->Buffer.IO_Buffer.pBuffer[ep->Buffer.IO_Buffer.offset + i] = EPx_RX_FIFO_DATA(EPx);
//                    }
//                    RX_FIFO_FORCE_EMPTY(EPx);
//                    ep->Buffer.IO_Buffer.offset += count;

            USB_GetData( EPx, &ep->Buffer.IO_Buffer.pBuffer[ ep->Buffer.IO_Buffer.offset ] );
            ep->Buffer.IO_Buffer.offset += count;

            /* If offset >= length (transfer is over), indicate it with NAK state
             * and call handler (if present) */
            if ( ep->Buffer.IO_Buffer.offset >= ep->Buffer.IO_Buffer.length )
            {
                ep->EP_State = USB_EP_NAK;
                if ( ep->OutHandler != 0 )
                {
                    result = ep->OutHandler( EPx, ep->Buffer.IO_Buffer.pBuffer, ep->Buffer.IO_Buffer.offset );
                }

                if ( result == USB_SUCCESS )
                {
                    /* If no other transaction is ordered by user or no data stage of SETUP
                     * packet (state isn't changed), go to NAK/IDLE state */
                    if ( ep->EP_State == USB_EP_NAK )
                    {
                        USB_EP_Idle( EPx );
                    }
                }
                else
                {
                    /* If user's handler indicated error, go to STALL/NAK state */
                    USB_EP_Stall( EPx, USB_STALL_PROTO );
                }
            }
            else
            {
                /* If offset < length, wait for another portion */
//                        USB_EP_SetReady(EPx, USB_SEPx_CTRL_EPRDY_Ready);
            }
//                }
            break;
        }

        /* USB_EP_SETUP */
        case USB_EP_SETUP:
        {
            /* Check for event */
//                if (ep->EP_WasScdone)
//                {
            assert_param( ep->SetupHandler );

            /* Read setup packet and check for correct size (8 bytes) */
            count = USB_GetRxCnt( EPx );
            if ( count == 8 )
            {
//                        USB_EP0_GET((uint32_t*)ep->Buffer.pSetupPacket);
                USB_GetData( EPx, ( uint8_t* )ep->Buffer.pSetupPacket );
//                        for (i = 0; i < count; i++)
//                        {
//                            ((uint8_t*)ep->Buffer.pSetupPacket)[i] = EPx_RX_FIFO_DATA(EPx);
//                        }
//                        RX_FIFO_FORCE_EMPTY(EPx);

                /* Call the handler */
                result = ep->SetupHandler( EPx, ep->Buffer.pSetupPacket );

                if ( result == USB_SUCCESS )
                {
                    /* If no other transaction is ordered by user or no data stage of SETUP
                     * packet (state isn't changed), go to NAK/IDLE state */
                    if ( ep->EP_State == USB_EP_SETUP )
                    {
                        USB_EP_Idle( EPx );
                    }
                }
                else
                {
                    /* If user's handler indicated error, go to STALL/NAK state */
                    USB_EP_Stall( EPx, USB_STALL_PROTO );
                }
            }
            else                                                                                               /* Incorrect packet size */
            {
//                        RX_FIFO_FORCE_EMPTY(EPx);
                result = USB_ERROR;
//                        /* Switch into STALL state */
//
//                        USB_EP_Stall(EPx, USB_STALL_PROTO);

