ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Examples/MDR1986VK01/usb_cdc_echo/MDR1986VK01_usb_device.c
/** @defgroup USB_Device_Private_Handlers USB Device Handlers implementation
 * @{
 */

/**
 * @brief  Reset bus handler
 *
 * @param  None
 *
 * @retval USB_Result.
 */

USB_Result USB_DeviceReset( void )
{
    USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_DEFAULT;
    USB_DeviceContext.Address         = 0;
    return USB_SUCCESS;
}

/**
 * @brief  Performs all necessary actions on entering to SUSPENDED state
 *
 * @param  None
 *
 * @retval USB_Result.
 */

USB_Result USB_DeviceSuspend( void )
{
    return USB_SUCCESS;
}

/**
 * @brief  Performs all necessary actions on exit from SUSPENDED state
 *
 * @param  None
 *
 * @retval USB_Result.
 */

USB_Result USB_DeviceResume( void )
{
    return USB_SUCCESS;
}

/**
 * @brief  Control Setup Packet processing dispatcher (set as EP0 setup
 *         packet handler).
 *
 * @param  EPx: USB Control EndPoint (EP0) number.
 *
 * @param  USB_SetupPacket: Pointer to a USB_SetupPacket_TypeDef structure
 *         that contains received setup packet contents (on success)
 *
 * @retval USB_Result.
 *
 * @note   This function interface reflects EndPoint setup packet handler
 *         requirements. Request setup packet data is placed into
 *         USB_CurrentSetupPacket variable to be accessible from the
 *         specific request type handlers.
 */

USB_Result USB_DeviceSetupPacket( USB_EP_TypeDef EPx, const USB_SetupPacket_TypeDef* USB_SetupPacket )
{
    USB_RequestType_TypeDef   requestType;
    USB_RequestTypeDT_TypeDef requestDirection;

    USB_Result                result = USB_SUCCESS;
    uint16_t                  wValue, wIndex, wLength;

    /* Check the parameters */
    assert_param( IS_USB_ENDPOINT( EPx ) );

    /* Determine request type */
    requestType      = ( USB_RequestType_TypeDef )( USB_SetupPacket->mRequestTypeData & USB_REQUEST_TYPE_Msk );
    requestDirection = ( USB_RequestTypeDT_TypeDef )( USB_SetupPacket->mRequestTypeData & USB_REQUEST_DT_Msk );

    /* Process request */
    switch ( requestType )
    {
    /* Standard request */
    case USB_TYPE_STANDARD: {
        USB_RequestRecipient_TypeDef recipient;
        USB_EP_IO_Handler            statusAckHandler = 0;

        wValue  = USB_SetupPacket->wValue;
        wIndex  = USB_SetupPacket->wIndex;
        wLength = USB_SetupPacket->wLength;

        /* Recipient check */
        recipient =
            ( USB_RequestRecipient_TypeDef )( USB_SetupPacket->mRequestTypeData & USB_RECIPIENT_TYPE_Msk );
        if ( !IS_VALID_USB_RECIPIENT( recipient ) )
        {
            result = USB_ERR_INV_REQ;
            break;
        }
        /* Specific requests */
        switch ( USB_SetupPacket->bRequest )
        {
        /* GET_STATUS */
        case USB_GET_STATUS:
            if ( requestDirection != USB_DEVICE_TO_HOST ||
                 ( USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS &&
                   ( recipient == USB_RECIPIENT_INTERFACE ||
                     ( recipient == USB_RECIPIENT_ENDPOINT && wIndex >= Num_USB_EndPoints ) ) ) )
            {
                result = USB_ERROR;
            }
            else
            {
                /* Give user a chance to set flags in the device context */
                result = USB_DEVICE_HANDLE_GET_STATUS( recipient, wIndex );
                if ( result == USB_SUCCESS )
                {
                    switch ( recipient )
                    {
                    /* Device - return Self Powered and Remote Wakeup status */
                    case USB_RECIPIENT_DEVICE:
                        SetupPacketData[ 0 ] = 0
#ifdef USB_SELF_POWERED_SUPPORTED
                                               | USB_DeviceContext.USB_DeviceStatus.SelfPowered
#endif                                                                                                         /* USB_SELF_POWERED_SUPPORTED */
#ifdef USB_REMOTE_WAKEUP_SUPPORTED
                                               | ( USB_DeviceContext.USB_DeviceStatus.RemoteWakeupEnabled << 1 )
#endif                                                                                                         /* USB_REMOTE_WAKEUP_SUPPORTED */
                        ;
                        break;
                    /* Interface - return 0 */
                    case USB_RECIPIENT_INTERFACE:
                        SetupPacketData[ 0 ] = 0;
                        break;
                    /* Endpoint - return Halt status */
                    case USB_RECIPIENT_ENDPOINT:
                        SetupPacketData[ 0 ] = USB_EPContext[ wIndex ].EP_Halt;
                        break;
                    default :
                        break;
                    }
                    SetupPacketData[ 1 ] = 0;
                    result               = USB_EP_doDataIn( EPx, SetupPacketData, 2, NULL );
                }
            }
            break;
        /* CLEAR_FEATURE */
        case USB_CLEAR_FEATURE:
            if ( USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS &&
                 ( recipient == USB_RECIPIENT_INTERFACE ||
                   ( recipient ==
                     USB_RECIPIENT_ENDPOINT && wIndex >= Num_USB_EndPoints ) ) )
            {
                result = USB_ERROR;
            }
            else
            {
                result = USB_DEVICE_HANDLE_CLEAR_FEATURE( recipient, wValue, wIndex );
            }
            break;
        /* SET_FEATURE */
        case USB_SET_FEATURE:
            if ( USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS &&
                 ( recipient == USB_RECIPIENT_INTERFACE ||
                   ( recipient ==
                     USB_RECIPIENT_ENDPOINT && wIndex >= Num_USB_EndPoints ) ) )
            {
                result = USB_ERROR;
            }
            else
            {
                result = USB_DEVICE_HANDLE_SET_FEATURE( recipient, wValue, wIndex );
            }
            break;
        /* SET_ADDRESS */
        case USB_SET_ADDRESS:
            result = USB_DEVICE_HANDLE_SET_ADDRESS( wValue );

