ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Examples/MDR1986VK01/usb_cdc_echo/MDR1986VK01_usb_device.c
/** @defgroup USB_Device_Status_Stage_Handlers USB Device Service Functions
 * @{
 */

/**
 * @brief Implements Status stage of Setup transaction with OUT data stage
 *        or without data stage. To be used as EndPoint transaction handler.
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @param  Buffer: Pointer to the user's buffer with portion of data
 *                 to be sent
 *
 * @param  Length: Length of data portion
 *
 * @retval USB_Result.
 *
 * @note   This function interface reflects EndPoint data transmitting handler
 *         requirements.
 */

USB_Result USB_DeviceDoStatusInAck( USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length )
{
    return USB_SUCCESS;
}

/**
 * @brief Implements Status stage of Setup transaction with IN data stage.
 *        To be used as EndPoint transaction handler.
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @param  Buffer: Pointer to the user's buffer for next portion of data
 *
 * @param  Length: Length of data portion
 *
 * @retval USB_Result.
 *
 * @note   This function interface reflects EndPoint data transmitting handler
 *         requirements.
 */

USB_Result USB_DeviceDoStatusOutAck( USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length )
{
    MDR_USB0->INDEX       = 0;
    MDR_USB0->CSR0_TXCSR |= ( 1 << USB_CSR0_FLUSH_FIFO );
    return USB_SUCCESS;  //USB_EP_doDataOut(EPx, 0, 0, 0);
}

/**
 * @brief Implements Status stage of Setup SET_ADDRESS transaction.
 *        Actually changes the device address. To be used as EndPoint
 *        transaction handler.
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @param  Buffer: Pointer to the user's buffer with portion of data
 *                 to be sent
 *
 * @param  Length: Length of data portion
 *
 * @retval USB_Result.
 *
 * @note   This function interface reflects EndPoint data transmitting handler
 *         requirements.
 */

static USB_Result USB_Device_setAddressWork( USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length )
{
    /* Set address */
    USB_SetSA( USB_DeviceContext.Address );
    /* Adjust device state */
    USB_DeviceContext.USB_DeviceState =
        ( USB_DeviceContext.Address ? USB_DEV_STATE_ADDRESS : USB_DEV_STATE_DEFAULT );

    return USB_SUCCESS;
}

/** @} */ /* End of group USB_Device_Status stage _Handlers */

/**
 * @brief  Default implementation of USB interrupt handler
 *
 * @param  None
 *
 * @retval None
 *
 * @note   To be overwritten, USB_INT_HANDLE_REQUIRED definition should be
 *         undefined.
 *
 */

void USB_IRQHandler( void )
{
    uint16_t UsbIntr;
    uint16_t csr;

    if ( 0 != USB_DeviceContext.Address )
    {
        MDR_USB0->FADDR = USB_DeviceContext.Address;
        USB_DeviceContext.Address = 0;
    }

    /* Get masked interrupt flags */
    UsbIntr = MDR_USB0->INTRUSB;

    if ( UsbIntr & ( 1 << USB_INTR_RST_BIT ) )
    {
        USB_DEVICE_HANDLE_RESET;
    }

    uint16_t TxIntr = MDR_USB0->INTRTX;
    uint16_t RxIntr = MDR_USB0->INTRRX;

/* Invoke End Point dispatchers */
    /* IN */
    if ( TxIntr & 0x1 )
    {
        MDR_USB0->INDEX = 0;
        csr             = MDR_USB0->CSR0_TXCSR;

        if ( csr & ( 1 << USB_CSR0_SETUP_END ) /*||
                                                  csr & ( 1 << USB_CSR0_SENT_STALL )*/)
        {
//            MDR_USB0->CSR0_TXCSR &= ~(1 << USB_CSR0_SENT_STALL);
//            MDR_USB0->CSR0_TXCSR |= (1 << USB_CSR0_FLUSH_FIFO);
//            MDR_USB0->CSR0_TXCSR |= (1 << USB_CSR0_SEND_STALL);
//            USB_DeviceContext.Address = 0;
            MDR_USB0->CSR0_TXCSR |= ( 1 << USB_CSR0_SRV_SETUP_END );
        }

        if ( csr & ( 1 << USB_CSR0_RX_PKT_RDY ) )
            USB_EP_dispatchEvent( USB_EP0, UsbIntr );
    }
    if ( TxIntr & 0x2 )
        USB_EP_dispatchEvent( USB_EP1, UsbIntr );
    if ( TxIntr & 0x4 )
        USB_EP_dispatchEvent( USB_EP2, UsbIntr );
    if ( TxIntr & 0x8 )
        USB_EP_dispatchEvent( USB_EP3, UsbIntr );

    /* OUT */
    if ( RxIntr & 0x2 )
        USB_EP_dispatchEvent( USB_EP1, UsbIntr );
    if ( RxIntr & 0x4 )
        USB_EP_dispatchEvent( USB_EP2, UsbIntr );
    if ( RxIntr & 0x8 )
        USB_EP_dispatchEvent( USB_EP3, UsbIntr );
    //        for (i = USB_EP0; i < Num_USB_EndPoints; i++)
    //        {
    //            USB_EP_dispatchEvent((USB_EP_TypeDef)i, USB_IT);
    //        }

    //        /* Clear pending bits, except for SCTDONE */
    //        USB_SetSIS(USB_IT & (~USB_SIS_SCTDONE_Set));
}


/** @defgroup USB_Device_Private_Dummy_Functions USB Device Private Handler Samples
 * @{
 */

/**
 * @brief  GET_STATUS standard request handler sample (9.4.5).
 *
 * @param  Recipient: Recipient type (from setup packet header).
 *         This parameter can be one of the following values:
 *         USB_RECIPIENT_DEVICE, USB_RECIPIENT_INTERFACE,
 *         USB_RECIPIENT_ENDPOINT, USB_RECIPIENT_OTHER.
 *
 * @param  wINDEX: Interface or EndPoint number, if Recipient has
 *         appropriate value.
 *
 * @retval USB_Result.
 *
 * @note   Intended to update USB_DeviceStatus field of the device context
 *         before the status to be sent to host. Data stage begins if USB_SUCCESS
 *         is returned.
 */

USB_Result USB_DeviceDummyGetStatus( USB_RequestRecipient_TypeDef Recipient, uint16_t wINDEX )
{
    return USB_SUCCESS;
}

/**
 * @brief  SET_ADDRESS standard request handler (preparation) sample (9.4.6).
 *
 * @param  wVALUE: New device address
 *
 * @retval USB_Result.
 *
 * @note   Intended to do perform actions while still in setup transaction
 *         (actual address change to be performed after status stage completes).
 *         If value returned is not USB_SUCCESS, transaction is aborted.
 */

USB_Result USB_DeviceDummySetAddress( uint16_t wVALUE )
{
    return USB_SUCCESS;
}

/**
 * @brief  GET_DESCRIPTOR standard request handler sample (9.4.3).
 *
 * @param  wVALUE: Descriptor Type and Descriptor Index
 *
 * @param  wINDEX: Zero or Language ID (see 9.6.7)
 *
 * @param  wLENGTH: Amount of data host is willing to receive.
 *
 * @retval USB_Result.
 *
 * @note   This handler is called in correct state only. It's to be implemented
 *         in any device class. It is expected to either perform data transfer
 *         and status stages on its own (calling USB_EP_doDataIn), or return
 *         value that is not USB_SUCCESS.
 */

