ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Examples/MDR1986VK01/usb_cdc_echo/MDR1986VK01_usb_device.c
USB_Result USB_DeviceDummyGetDescriptor( uint16_t wVALUE, uint16_t wINDEX, uint16_t wLENGTH )
{
    return USB_ERROR;
}

/**
 * @brief  SET_DESCRIPTOR standard request handler sample (9.4.8).
 *
 * @param  wVALUE: Descriptor Type and Descriptor Index
 *
 * @param  wINDEX: Zero or Language ID (see 9.6.7)
 *
 * @param  wLENGTH: Amount of data to be sent by host.
 *
 * @retval USB_Result.
 *
 * @note   This handler is called in correct state only. It's to be implemented
 *         only if the device supports descriptor update by host. It is expected
 *         to either perform data transfer and status stages on its own (calling
 *         USB_EP_doDataOut), or return value that is not USB_SUCCESS.
 */

USB_Result USB_DeviceDummySetDescriptor( uint16_t wVALUE, uint16_t wINDEX, uint16_t wLENGTH )
{
    return USB_ERROR;
}

/**
 * @brief  GET_CONFIGURATION standard request handler sample (9.4.2).
 *
 * @param  None
 *
 * @retval Currently selected configuration number or 0 on error.
 *
 * @note   This handler is called in correct state only. It's to be implemented
 *         if the device supports more than one configuration.
 */

uint8_t USB_DeviceDummyGetConfiguration( void )
{
    return 1;
}

/**
 * @brief  SET_CONFIGURATION standard request handler sample (9.4.7).
 *
 * @param  wVALUE: Configuration number
 *
 * @retval USB_Result.
 *
 * @note   This handler is called in correct state only. It's to be implemented
 *         if the device supports more than one configuration.
 */

USB_Result USB_DeviceDummySetConfiguration( uint16_t wVALUE )
{
    return USB_ERROR;
}

/**
 * @brief  GET_INTERFACE standard request handler sample (9.4.4).
 *
 * @param  wINDEX: Interface number.
 *
 * @retval Currently selected alternate setting for the specified interface
 *         or 0 in case of error.
 *
 * @note   This handler is called in correct state only. It's to be implemented
 *         if the device supports interfaces with alternate settings.
 */

uint8_t USB_DeviceDummyGetInterface( uint16_t wINDEX )
{
    return 0;
}

/**
 * @brief  SET_INTERFACE standard request handler sample (9.4.10).
 *
 * @param  wVALUE: Alternate setting to be set.
 *
 * @param  wINDEX: Interface number.
 *
 * @retval USB_Result.
 *
 * @note   This handler is called in correct state only. It's to be implemented
 *         if the device supports interfaces with alternate settings.
 */

USB_Result USB_DeviceDummySetInterface( uint16_t wVALUE, uint16_t wINDEX )
{
    return USB_SUCCESS;
}

/**
 * @brief  SYNC_FRAME standard request handler sample (9.4.11).
 *
 * @param  wINDEX: EndPoint number.
 *
 * @param  DATA: Pointer for frame number.
 *
 * @retval USB_Result.
 *
 * @note   This handler is called in correct state only. It's to be implemented
 *         if some of the device EndPoints support isochronous transfers. It is
 *         expected to place EndPoint synchronization frame number into DATA pointed
 *         location or return value that is not USB_SUCCESS.
 */

USB_Result USB_DeviceDummySyncFrame( uint16_t wINDEX, uint8_t* DATA )
{
    return USB_ERROR;
}

/**
 * @brief  Class-type setup request handler sample.
 *
 * @param  None
 *
 * @retval USB_Result.
 *
 * @note   This handler is called in correct state only. It's to be implemented
 *         the device supports any class-type requests. Request setup packet data
 *         is accessible by USB_CurrentSetupPacket variable. The overwritten method
 *         should implement both data (if present) and status transfer stages.
 */

USB_Result USB_DeviceDummyClassRequest( void )
{
    return USB_ERROR;
}

/**
 * @brief  Vendor-type setup request handler sample.
 *
 * @param  None
 *
 * @retval USB_Result.
 *
 * @note   This handler is called in correct state only. It's to be implemented
 *         the device supports any vendor-type requests. Request setup packet data
 *         is accessible by USB_CurrentSetupPacket variable. The overwritten method
 *         should implement both data (if present) and status transfer stages.
 */


USB_Result USB_DeviceDummyVendorRequest( void )
{
    return USB_ERROR;
}


/**
 * @brief  EndPoint error handler sample.
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @param  STS: USB_SEPx.STS register value.
 *
 * @param  TS: USB_SEPx.TS register value.
 *
 * @param  CTRL: USB_SEPx.CTRL register value.
 *
 * @retval USB_Result.
 *
 * @note   This function interface reflects EndPoint error handler
 *         requirements. When called on IN transaction error:
 *          - if it hasn't start another transaction and returns USB_SUCCESS,
 *            then retry of data transmission would occur;
 *          - if it returns error code, EndPoint would be switched to
 *            NAK/STALL state.
 */

USB_Result USB_DeviceDummyDataError( USB_EP_TypeDef EPx, uint32_t STS, uint32_t TS, uint32_t CTRL )
{
    return USB_ERROR;
}

/** @} */ /* End of group USB_Device_Private_Dummy_Functions */


/** @} */ /* End of group USB_Device_Private_Functions */

/** @} */ /* End of group USB_Device */

/** @} */ /* End of group USB_DEVICE_AND_CDC */

/** @} */ /* End of group __MDR1986VK01_StdPeriph_Driver */

/******************* (C) COPYRIGHT 2022 Milandr *********/

/* END OF FILE MDR1986VK01_usb_device.c */


